#include <stdio.h>
#include <math.h>

int main (void) {
  float x, xsqrt;
  
  printf("input X: ");
  scanf("%f", &x);
	
  /*
    次のプログラムを書いてください．
    1. xの値を標準出力に書き出す（見やすく）
    2. xsqrtにxの正の平方根の計算して代入する．
       正の平方根は sqrt(x) で求められる．
    3. xsqrtの値を標準出力に書き出す（見やすく）
    4. x と xsqrt * xsqrt を比較し，
       等しければ「等しい」，
       等しくなければ「等しくない」
       と標準出力に表示する．
       
    入力したXの値によって，「等しい」と表示されたり
    「等しくない」と表示されたりする．
    例えば，2を入力したときは等しくないと表示される．
    2以外に「等しくない」と表示されることがわかった
    数字を，このコメント内に書いてください．
    プログラムはこのコメントの下に続けて書いてください．

    なお，sqrtなどの数学関数を含むプログラムは，
    math.hヘッダを読み込む必要があり，
    また，コンパイルのときに -lm を付ける必要があります．
  */
  
  return 0;
}
